Autodesk.Revit.DB.RelinquishedItems.GetRelinquishedWorksets
The elements that were relinquished by the current user.
Since:
2014

Autodesk.Revit.DB.RelinquishedItems.GetRelinquishedElements
The elements that were relinquished by the current user.
Since:
2014

Autodesk.Revit.DB.RelinquishedItems.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RelinquishedItems
List of elements and worksets that were relinquished by the current user.
Since:
2014